package com.example.zasada_tv;

import com.example.zasada_tv.mongo_collections.documents.*;
import com.example.zasada_tv.mongo_collections.embedded.*;
import com.example.zasada_tv.mongo_collections.interfaces.*;

import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.CommandLineRunner;
import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;
import org.springframework.data.mongodb.repository.config.EnableMongoRepositories;
import org.springframework.web.bind.annotation.*;

import java.time.LocalDateTime;
import java.util.*;

//@CrossOrigin(origins = "http://localhost:3000/")
//@RestController
//@RequestMapping
@SpringBootApplication
@EnableMongoRepositories
public class Main implements CommandLineRunner {

	@Autowired
	private AdminRepository adminRepository;

	@Autowired
	private TournamentRepository tournamentRepository;

	@Autowired
	private TeamRepository teamRepository;

	@Autowired
	private PlayerRepository playerRepository;

	@Autowired
	private CountryRepository countryRepository;

	private static LogParser logParser;


	public static void main(String[] args) {
		logParser = new LogParser();
		SpringApplication.run(Main.class, args);
	}


	@Override
	public void run(String... args) throws Exception {
		//init();


		// Тестируем добавление статистики после парсинга в БД
//		String match_id = "1";

		//ArrayList<Player> players = LogParser.parse();
//		for(Player player : players){
//			for(PlayerDoc playerDoc : playerRepository.findByNick(player.getNickname())){
//				for(PlayerStats playerStats : playerDoc.getPlayerStats()){
//					if(Objects.equals(playerStats.getMatch_id(), match_id)){
//						System.out.println(playerDoc.toString());
//						int kills = playerStats.getKills() + player.getKills();
//						int assists = playerStats.getAssists() + player.getAssists();
//						int deaths = playerStats.getDeaths() + player.getDeaths();
//
//						playerStats.setKills(kills);
//						playerStats.setAssists(assists);
//						playerStats.setDeaths(deaths);
//						System.out.println(playerDoc.toString());
//						playerRepository.save(playerDoc);
//					}
//				}
//			}
//		}
	}


	//@PostMapping
	//@GetMapping("")
//	public String getPost(@RequestBody String input){
	public String getPost(){
//		String[] inputArray = input.split("\n");
//		for (int i = 0; i < inputArray.length; ++i){
//			if (inputArray[i].contains("killed") && inputArray[i].contains("with")){
//				String temp = inputArray[i];
//				if (i + 1 < inputArray.length){
//					if ((inputArray[i + 1].contains("flash-assisted killing")) || (inputArray[i + 1].contains("assisted killing") && !inputArray[i + 1].contains("flash-assisted killing"))) {
//						temp += ". " + inputArray[i + 1];
//						++i;
//					}
//				}
//				if (i + 2 < inputArray.length){
//					if ((inputArray[i + 2].contains("flash-assisted killing")) || (inputArray[i + 2].contains("assisted killing") && !inputArray[i + 2].contains("flash-assisted killing"))) {
//						temp += ". " + inputArray[i + 2];
//						++i;
//					}
//				}
//				logParser.parse(temp);
//			} else if (inputArray[i].contains(">\" picked up \"")){
//				String temp = inputArray[i];
//				if (i + 1 < inputArray.length){
//					if(inputArray[i + 1].contains("purchased")) {
//						temp = inputArray[i + 1];
//						++i;
//					}
//				}
//				logParser.parse(temp);
//			} else if(inputArray[i].contains("was killed by the bomb")){
//				String temp = inputArray[i];
//				if (i + 1 < inputArray.length){
//					if(inputArray[i + 1].contains("committed suicide with \"world\""))
//						++i;
//				}
//				logParser.parse(temp);
//			}
//			else
//				logParser.parse(inputArray[i]);
//		}
		return "Test";
		//System.out.println("Ну.... " + input);
	}


	private void init(){
		testCountry();
		// Тестируем запросы в БД
//		testAdmin();
//		testPlayer();
//		testTeam();
//		testTournament();
	}


	private void testCountry(){
		//countryRepository.deleteAll();
		ArrayList<String> citiesAlbania = new ArrayList<String>(Arrays.asList("Балши", "Берат", "Буррели", "Влёра", "Гирокастра", "Дельвина", "Дуррес", "Кавая", "Конисполь", "Корча", "Круя", "Кукес", "Кучова", "Лежа", "Либохова", "Либражд", "Люшня", "Орикум", "Патос", "Пекин", "Пермети", "Пешкопия", "Поградец", "Рубику", "Саранда", "Тепелена", "Тирана", "Тропоя", "Фиери", "Химара", "Чоровода", "Шкодер", "Эльбасан"));
		CountryDoc countryDocAlbania = new CountryDoc("Албания", "Albania", citiesAlbania);
		countryRepository.save(countryDocAlbania);

		ArrayList<String> citiesBelize = new ArrayList<String>(Arrays.asList("Белиз", "Бельмопан", "Бенке-Вьехо-дель-Кармен", "Биг Фолс", "Буэно-Виста", "Гвинея Грасс", "Дангрига", "Джорджевилл", "Коросаль", "Ледивилл", "Литл Белиз", "Маллинс Ривер", "Маскалл", "Медина Банк", "Ориндж-Уолк", "Пласенсия", "Пунта-Горда", "Рок Стон Понд", "Санд-Хилл", "Сан-Игнасио", "Сан-Педро", "Санта-Ана", "Сеайн Байт", "Спаниш Лукаут", "Хаттивилл", "Хопкинс"));
		CountryDoc countryDocBelize = new CountryDoc("Белиз", "Belize", citiesBelize);
		countryRepository.save(countryDocBelize);

		ArrayList<String> citiesSpain = new ArrayList<String>(Arrays.asList("Аликанте", "Алькала-де-Энарес", "Бадалона", "Барселона", "Бильбао", "Валенсия", "Вальядолид", "Виго", "Витория", "Гранада", "Картахена", "Кордова", "Ла-Корунья", "Лас-Пальмас-де-Гран-Канария", "Мадрид", "Малага", "Мостолес", "Мурсия", "Овьедо", "Оспиталет", "Пальма", "Сабадель", "Санта-Крус-де-Тенерифе", "Сарагоса", "Севилья", "Террасса", "Херес-де-ла-Фронтера", "Хихон", "Эльче"));
		CountryDoc countryDocSpain = new CountryDoc("Испания", "Spain", citiesSpain);
		countryRepository.save(countryDocSpain);

		ArrayList<String> citiesKosovo = new ArrayList<String>(Arrays.asList("Витина", "Вучитрн", "Глоговац", "Гнилане", "Дечани", "Джяковица", "Драгаш", "Звечан", "Исток", "Качаник", "Клина", "Косово-Поле", "Косовска-Каменица", "Косовска-Митровица", "Лепосавич", "Лешак", "Липлян", "Малишево", "Обилич", "Ораховац", "Печ", "Подуево", "Призрен", "Приштина", "Србица", "Сува-Река", "Урошевац", "Штимле", "Штрпце"));
		CountryDoc countryDocKosovo = new CountryDoc("Косово", "Kosovo", citiesKosovo);
		countryRepository.save(countryDocKosovo);

		ArrayList<String> citiesIsleOfMan = new ArrayList<String>(Arrays.asList("Андреас", "Балласалла", "Баллох", "Брайд", "Долби", "Дуглас", "Каслтаун", "Кирк-Майкл", "Кросби", "Крэнстал", "Лакси", "Ланчан", "Могхолд", "Онкан", "Пил", "Порт-Ирин", "Порт-Сент-Мэри", "Пэтрик", "Рэмси", "Салби", "Сент-Джонс", "Сент-Маркс", "Уэст-Джерби", "Фоксдейл"));
		CountryDoc countryDocIsleOfMan = new CountryDoc("Остров Мэн", "IsleOfMan", citiesIsleOfMan);
		countryRepository.save(countryDocIsleOfMan);

		ArrayList<String> citiesRU = new ArrayList<String>(Arrays.asList("Абаза", "Абакан", "Абдулино", "Абинск", "Агидель", "Агрыз", "Адыгейск", "Азнакаево", "Азов", "Ак-Довурак", "Аксай", "Алагир", "Алапаевск", "Алатырь", "Алдан", "Алейск", "Александров", "Александровск", "Александровск-Сахалинский", "Алексеевка", "Алексин", "Алзамай", "Алупка", "Алушта", "Альметьевск", "Амурск", "Анадырь", "Анапа", "Ангарск", "Андреаполь", "Анжеро-Судженск", "Анива", "Апатиты", "Апрелевка", "Апшеронск", "Арамиль", "Аргун", "Ардатов", "Ардон", "Арзамас", "Аркадак", "Армавир", "Армянск", "Арсеньев", "Арск", "Артём", "Артёмовск", "Артёмовский", "Архангельск", "Асбест", "Асино", "Астрахань", "Аткарск", "Ахтубинск", "Ачинск", "Ачхой-Мартан", "Аша", "Бабаево", "Бабушкин", "Бавлы", "Багратионовск", "Байкальск", "Баймак", "Бакал", "Баксан", "Балабаново", "Балаклава", "Балаково", "Балахна", "Балашиха", "Балашов", "Балей", "Балтийск", "Барабинск", "Барнаул", "Барыш", "Батайск", "Бахчисарай", "Бежецк", "Белая Калитва", "Белая Холуница", "Белгород", "Белебей", "Белинский", "Белово", "Белогорск", "Белогорск", "Белозерск", "Белокуриха", "Беломорск", "Белоозёрский", "Белорецк", "Белореченск", "Белоусово", "Белоярский", "Белый", "Белёв", "Бердск", "Березники", "Берёзовский", "Берёзовский", "Беслан", "Бийск", "Бикин", "Билибино", "Биробиджан", "Бирск", "Бирюсинск", "Бирюч", "Благовещенск", "Благовещенск", "Благодарный", "Бобров", "Богданович", "Богородицк", "Богородск", "Боготол", "Богучар", "Бодайбо", "Бокситогорск", "Болгар", "Бологое", "Болотное", "Болохово", "Болхов", "Большой Камень", "Бор", "Борзя", "Борисоглебск", "Боровичи", "Боровск", "Бородино", "Братск", "Бронницы", "Брянск", "Бугульма", "Бугуруслан", "Будённовск", "Бузулук", "Буинск", "Буй", "Буйнакск", "Бутурлиновка", "Валдай", "Валуйки", "Велиж", "Великие Луки", "Великий Новгород", "Великий Устюг", "Вельск", "Венёв", "Верещагино", "Верея", "Верхнеуральск", "Верхний Тагил", "Верхний Уфалей", "Верхняя Пышма", "Верхняя Салда", "Верхняя Тура", "Верхотурье", "Верхоянск", "Весьегонск", "Ветлуга", "Видное", "Вилюйск", "Вилючинск", "Вихоревка", "Вичуга", "Владивосток", "Владикавказ", "Владимир", "Волгоград", "Волгодонск", "Волгореченск", "Волжск", "Волжский", "Вологда", "Володарск", "Волоколамск", "Волосово", "Волхов", "Волчанск", "Вольск", "Воркута", "Воронеж", "Ворсма", "Воскресенск", "Воткинск", "Всеволожск", "Вуктыл", "Выборг", "Выкса", "Высоковск", "Высоцк", "Вытегра", "Вышний Волочёк", "Вяземский", "Вязники", "Вязьма", "Вятские Поляны", "Гаврилов Посад", "Гаврилов-Ям", "Гагарин", "Гаджиево", "Гай", "Галич", "Гатчина", "Гвардейск", "Гдов", "Геленджик", "Георгиевск", "Глазов", "Голицыно", "Горбатов", "Горно-Алтайск", "Горнозаводск", "Горняк", "Городец", "Городище", "Городовиковск", "Гороховец", "Горячий Ключ", "Грайворон", "Гремячинск", "Грозный", "Грязи", "Грязовец", "Губаха", "Губкин", "Губкинский", "Гудермес", "Гуково", "Гулькевичи", "Гурьевск", "Гурьевск", "Гусев", "Гусиноозёрск", "Гусь-Хрустальный", "Давлеканово", "Дагестанские Огни", "Далматово", "Дальнегорск", "Дальнереченск", "Данилов", "Данков", "Дегтярск", "Дедовск", "Демидов", "Дербент", "Десногорск", "Джанкой", "Дзержинск", "Дзержинский", "Дивногорск", "Дигора", "Димитровград", "Дмитриев", "Дмитров", "Дмитровск", "Дно", "Добрянка", "Долгопрудный", "Долинск", "Домодедово", "Донецк", "Донской", "Дорогобуж", "Дрезна", "Дубна", "Дубовка", "Дудинка", "Духовщина", "Дюртюли", "Дятьково", "Евпатория", "Егорьевск", "Ейск", "Екатеринбург", "Елабуга", "Елец", "Елизово", "Ельня", "Еманжелинск", "Емва", "Енисейск", "Ермолино", "Ершов", "Ессентуки", "Ефремов", "Железноводск", "Железногорск", "Железногорск", "Железногорск-Илимский", "Жердевка", "Жигулёвск", "Жиздра", "Жирновск", "Жуков", "Жуковка", "Жуковский", "Завитинск", "Заводоуковск", "Заволжск", "Заволжье", "Задонск", "Заинск", "Закаменск", "Заозёрный", "Заозёрск", "Западная Двина", "Заполярный", "Зарайск", "Заречный", "Заречный", "Заринск", "Звенигово", "Звенигород", "Зверево", "Зеленогорск", "Зеленогорск", "Зеленоград", "Зеленоградск", "Зеленодольск", "Зеленокумск", "Зерноград", "Зея", "Зима", "Златоуст", "Злынка", "Змеиногорск", "Знаменск", "Зубцов", "Зуевка", "Ивангород", "Иваново", "Ивантеевка", "Ивдель", "Игарка", "Ижевск", "Избербаш", "Изобильный", "Иланский", "Инза", "Инкерман", "Иннополис", "Инсар", "Инта", "Ипатово", "Ирбит", "Иркутск", "Исилькуль", "Искитим", "Истра", "Ишим", "Ишимбай", "Йошкар-Ола", "Кадников", "Казань", "Калач", "Калач-на-Дону", "Калачинск", "Калининград", "Калининск", "Калтан", "Калуга", "Калязин", "Камбарка", "Каменка", "Каменногорск", "Каменск-Уральский", "Каменск-Шахтинский", "Камень-на-Оби", "Камешково", "Камызяк", "Камышин", "Камышлов", "Канаш", "Кандалакша", "Канск", "Карабаново", "Карабаш", "Карабулак", "Карасук", "Карачаевск", "Карачев", "Каргат", "Каргополь", "Карпинск", "Карталы", "Касимов", "Касли", "Каспийск", "Катав-Ивановск", "Катайск", "Качканар", "Кашин", "Кашира", "Кедровый", "Кемерово", "Кемь", "Керчь", "Кизел", "Кизилюрт", "Кизляр", "Кимовск", "Кимры", "Кингисепп", "Кинель", "Кинешма", "Киреевск", "Киренск", "Киржач", "Кириллов", "Кириши", "Киров", "Киров", "Кировград", "Кирово-Чепецк", "Кировск", "Кировск", "Кирс", "Кирсанов", "Киселёвск", "Кисловодск", "Клин", "Клинцы", "Княгинино", "Ковдор", "Ковров", "Ковылкино", "Когалым", "Кодинск", "Козельск", "Козловка", "Козьмодемьянск", "Кола", "Кологрив", "Коломна", "Колпашево", "Колпино", "Кольчугино", "Коммунар", "Комсомольск", "Комсомольск-на-Амуре", "Конаково", "Кондопога", "Кондрово", "Константиновск", "Копейск", "Кораблино", "Кореновск", "Коркино", "Королёв", "Короча", "Корсаков", "Коряжма", "Костерёво", "Костомукша", "Кострома", "Котельники", "Котельниково", "Котельнич", "Котлас", "Котово", "Котовск", "Кохма", "Красавино", "Красноармейск", "Красноармейск", "Красновишерск", "Красногорск", "Краснодар", "Красное Село", "Краснозаводск", "Краснознаменск", "Краснознаменск", "Краснокаменск", "Краснокамск", "Красноперекопск", "Краснослободск", "Краснослободск", "Краснотурьинск", "Красноуральск", "Красноуфимск", "Красноярск", "Красный Кут", "Красный Сулин", "Красный Холм", "Кремёнки", "Кронштадт", "Кропоткин", "Крымск", "Кстово", "Кубинка", "Кувандык", "Кувшиново", "Кудрово", "Кудымкар", "Кузнецк", "Куйбышев", "Кукмор", "Кулебаки", "Кумертау", "Кунгур", "Купино", "Курган", "Курганинск", "Курильск", "Курлово", "Куровское", "Курск", "Куртамыш", "Курчалой", "Курчатов", "Куса", "Кушва", "Кызыл", "Кыштым", "Кяхта", "Лабинск", "Лабытнанги", "Лагань", "Ладушкин", "Лаишево", "Лакинск", "Лангепас", "Лахденпохья", "Лебедянь", "Лениногорск", "Ленинск", "Ленинск-Кузнецкий", "Ленск", "Лермонтов", "Лесной", "Лесозаводск", "Лесосибирск", "Ливны", "Ликино-Дулёво", "Липецк", "Липки", "Лиски", "Лихославль", "Лобня", "Лодейное Поле", "Ломоносов", "Лосино-Петровский", "Луга", "Луза", "Лукоянов", "Луховицы", "Лысково", "Лысьва", "Лыткарино", "Льгов", "Любань", "Люберцы", "Любим", "Людиново", "Лянтор", "Магадан", "Магас", "Магнитогорск", "Майкоп", "Майский", "Макаров", "Макарьев", "Макушино", "Малая Вишера", "Малгобек", "Малмыж", "Малоархангельск", "Малоярославец", "Мамадыш", "Мамоново", "Мантурово", "Мариинск", "Мариинский Посад", "Маркс", "Махачкала", "Мглин", "Мегион", "Медвежьегорск", "Медногорск", "Медынь", "Межгорье", "Междуреченск", "Мезень", "Меленки", "Мелеуз", "Менделеевск", "Мензелинск", "Мещовск", "Миасс", "Микунь", "Миллерово", "Минеральные Воды", "Минусинск", "Миньяр", "Мирный", "Мирный", "Михайлов", "Михайловка", "Михайловск", "Михайловск", "Мичуринск", "Могоча", "Можайск", "Можга", "Моздок", "Мончегорск", "Морозовск", "Моршанск", "Мосальск", "Москва", "Московский", "Муравленко", "Мураши", "Мурино", "Мурманск", "Муром", "Мценск", "Мыски", "Мытищи", "Мышкин", "Набережные Челны", "Навашино", "Наволоки", "Надым", "Назарово", "Назрань", "Называевск", "Нальчик", "Нариманов", "Наро-Фоминск", "Нарткала", "Нарьян-Мар", "Находка", "Невель", "Невельск", "Невинномысск", "Невьянск", "Нелидово", "Неман", "Нерехта", "Нерчинск", "Нерюнгри", "Нестеров", "Нефтегорск", "Нефтекамск", "Нефтекумск", "Нефтеюганск", "Нея", "Нижневартовск", "Нижнекамск", "Нижнеудинск", "Нижние Серги", "Нижний Ломов", "Нижний Новгород", "Нижний Тагил", "Нижняя Салда", "Нижняя Тура", "Николаевск", "Николаевск-на-Амуре", "Никольск", "Никольск", "Никольское", "Новая Ладога", "Новая Ляля", "Новоалександровск", "Новоалтайск", "Новоаннинский", "Нововоронеж", "Новодвинск", "Новозыбков", "Новокубанск", "Новокузнецк", "Новокуйбышевск", "Новомичуринск", "Новомосковск", "Новопавловск", "Новоржев", "Новороссийск", "Новосибирск", "Новосиль", "Новосокольники", "Новотроицк", "Новоузенск", "Новоульяновск", "Новоуральск", "Новохопёрск", "Новочебоксарск", "Новочеркасск", "Новошахтинск", "Новый Оскол", "Новый Уренгой", "Ногинск", "Нолинск", "Норильск", "Ноябрьск", "Нурлат", "Нытва", "Нюрба", "Нягань", "Нязепетровск", "Няндома", "Облучье", "Обнинск", "Обоянь", "Обь", "Одинцово", "Озёрск", "Озёрск", "Озёры", "Октябрьск", "Октябрьский", "Окуловка", "Оленегорск", "Олонец", "Олёкминск", "Омск", "Омутнинск", "Онега", "Опочка", "Оренбург", "Орехово-Зуево", "Орлов", "Орск", "Орёл", "Оса", "Осинники", "Осташков", "Остров", "Островной", "Острогожск", "Отрадное", "Отрадный", "Оха", "Оханск", "Очёр", "Павлово", "Павловск", "Павловск", "Павловский Посад", "Палласовка", "Партизанск", "Певек", "Пенза", "Первомайск", "Первоуральск", "Перевоз", "Пересвет", "Переславль-Залесский", "Пермь", "Пестово", "Петергоф", "Петров Вал", "Петровск", "Петровск-Забайкальский", "Петрозаводск", "Петропавловск-Камчатский", "Петухово", "Петушки", "Печора", "Печоры", "Пикалёво", "Пионерский", "Питкяранта", "Плавск", "Пласт", "Плёс", "Поворино", "Подольск", "Подпорожье", "Покачи", "Покров", "Покровск", "Полевской", "Полесск", "Полысаево", "Полярные Зори", "Полярный", "Поронайск", "Порхов", "Похвистнево", "Почеп", "Починок", "Пошехонье", "Правдинск", "Приволжск", "Приморск", "Приморск", "Приморско-Ахтарск", "Приозерск", "Прокопьевск", "Пролетарск", "Протвино", "Прохладный", "Псков", "Пугачёв", "Пудож", "Пустошка", "Пучеж", "Пушкин", "Пушкино", "Пущино", "Пыталово", "Пыть-Ях", "Пятигорск", "Радужный", "Радужный", "Райчихинск", "Раменское", "Рассказово", "Ревда", "Реж", "Реутов", "Ржев", "Родники", "Рославль", "Россошь", "Ростов", "Ростов-на-Дону", "Рошаль", "Ртищево", "Рубцовск", "Рудня", "Руза", "Рузаевка", "Рыбинск", "Рыбное", "Рыльск", "Ряжск", "Рязань", "Саки", "Салават", "Салаир", "Салехард", "Сальск", "Самара", "Санкт-Петербург", "Саранск", "Сарапул", "Саратов", "Саров", "Сасово", "Сатка", "Сафоново", "Саяногорск", "Саянск", "Светлогорск", "Светлоград", "Светлый", "Светогорск", "Свирск", "Свободный", "Себеж", "Севастополь", "Северо-Курильск", "Северобайкальск", "Северодвинск", "Североморск", "Североуральск", "Северск", "Севск", "Сегежа", "Сельцо", "Семикаракорск", "Семилуки", "Семёнов", "Сенгилей", "Серафимович", "Сергач", "Сергиев Посад", "Сердобск", "Серов", "Серпухов", "Сертолово", "Сестрорецк", "Сибай", "Сим", "Симферополь", "Сковородино", "Скопин", "Славгород", "Славск", "Славянск-на-Кубани", "Сланцы", "Слободской", "Слюдянка", "Смоленск", "Снежинск", "Снежногорск", "Собинка", "Советск", "Советск", "Советск", "Советская Гавань", "Советский", "Сокол", "Солигалич", "Соликамск", "Солнечногорск", "Соль-Илецк", "Сольвычегодск", "Сольцы", "Сорочинск", "Сорск", "Сортавала", "Сосенский", "Сосновка", "Сосновоборск", "Сосновый Бор", "Сосногорск", "Сочи", "Спас-Деменск", "Спас-Клепики", "Спасск", "Спасск-Дальний", "Спасск-Рязанский", "Среднеколымск", "Среднеуральск", "Сретенск", "Ставрополь", "Старая Купавна", "Старая Русса", "Старица", "Стародуб", "Старый Крым", "Старый Оскол", "Стерлитамак", "Стрежевой", "Строитель", "Струнино", "Ступино", "Суворов", "Судак", "Суджа", "Судогда", "Суздаль", "Сунжа", "Суоярви", "Сураж", "Сургут", "Суровикино", "Сурск", "Сусуман", "Сухиничи", "Сухой Лог", "Сызрань", "Сыктывкар", "Сысерть", "Сычёвка", "Сясьстрой", "Тавда", "Таганрог", "Тайга", "Тайшет", "Талдом", "Талица", "Тамбов", "Тара", "Тарко-Сале", "Таруса", "Татарск", "Таштагол", "Тверь", "Теберда", "Тейково", "Темников", "Темрюк", "Терек", "Тетюши", "Тимашёвск", "Тихвин", "Тихорецк", "Тобольск", "Тогучин", "Тольятти", "Томари", "Томмот", "Томск", "Топки", "Торжок", "Торопец", "Тосно", "Тотьма", "Троицк", "Троицк", "Трубчевск", "Трёхгорный", "Туапсе", "Туймазы", "Тула", "Тулун", "Туран", "Туринск", "Тутаев", "Тында", "Тырныауз", "Тюкалинск", "Тюмень", "Уварово", "Углегорск", "Углич", "Удачный", "Удомля", "Ужур", "Узловая", "Улан-Удэ", "Ульяновск", "Унеча", "Урай", "Урень", "Уржум", "Урус-Мартан", "Урюпинск", "Усинск", "Усмань", "Усолье", "Усолье-Сибирское", "Уссурийск", "Усть-Джегута", "Усть-Илимск", "Усть-Катав", "Усть-Кут", "Усть-Лабинск", "Устюжна", "Уфа", "Ухта", "Учалы", "Уяр", "Фатеж", "Феодосия", "Фокино", "Фокино", "Фролово", "Фрязино", "Фурманов", "Хабаровск", "Хадыженск", "Ханты-Мансийск", "Харабали", "Харовск", "Хасавюрт", "Хвалынск", "Хилок", "Химки", "Холм", "Холмск", "Хотьково", "Цивильск", "Цимлянск", "Циолковский", "Чадан", "Чайковский", "Чапаевск", "Чаплыгин", "Чебаркуль", "Чебоксары", "Чегем", "Чекалин", "Челябинск", "Чердынь", "Черемхово", "Черепаново", "Череповец", "Черкесск", "Черноголовка", "Черногорск", "Чернушка", "Черняховск", "Чехов", "Чистополь", "Чита", "Чкаловск", "Чудово", "Чулым", "Чусовой", "Чухлома", "Чёрмоз", "Шагонар", "Шадринск", "Шали", "Шарыпово", "Шарья", "Шатура", "Шахты", "Шахунья", "Шацк", "Шебекино", "Шелехов", "Шенкурск", "Шилка", "Шимановск", "Шиханы", "Шлиссельбург", "Шумерля", "Шумиха", "Шуя", "Щербинка", "Щигры", "Щучье", "Щёкино", "Щёлкино", "Щёлково", "Электрогорск", "Электросталь", "Электроугли", "Элиста", "Энгельс", "Эртиль", "Югорск", "Южа", "Южно-Сахалинск", "Южно-Сухокумск", "Южноуральск", "Юрга", "Юрьев-Польский", "Юрьевец", "Юрюзань", "Юхнов", "Ядрин", "Якутск", "Ялта", "Ялуторовск", "Янаул", "Яранск", "Яровое", "Ярославль", "Ярцево", "Ясногорск", "Ясный", "Яхрома"));
		CountryDoc countryDocRU = new CountryDoc("Россия", "Russia", citiesRU);
		countryRepository.save(countryDocRU);
	}


	private void testPlayer() {
		System.out.println("\n-----------Игроки-----------");
		playerRepository.deleteAll();

		ArrayList<PlayerStats> playerStats = new ArrayList<PlayerStats>();
		playerStats.add(new PlayerStats("1", 20,5, 15));

		ArrayList<TournamentHistoryPlayers> tournamentHistoryPlayers = new ArrayList<TournamentHistoryPlayers>();
		tournamentHistoryPlayers.add(new TournamentHistoryPlayers("Pugachev Major 2022", "ПУПА"));
		tournamentHistoryPlayers.add(new TournamentHistoryPlayers("Zasada Cup", "ПУПА"));

		PlayerDoc playerDoc1 = new PlayerDoc("987e412udajin", "14q9w20e15t", "Tamada", "Симовин Кирилл",
				LocalDateTime.now(), "Russia", "Пугачёв", "steamcommunity.com/id/tamada4a",
				"VolceChat", "Tamada#2134", "vk.com/tarnada", "ПУПА",
				"Капитан", "disk.yandex.ru/i/2a-504tusqDEWA", tournamentHistoryPlayers,
				playerStats);

		PlayerDoc playerDoc2 = new PlayerDoc("987e2da412udajin",  "14q9w20e15t","Hitry_Kazah", "Актаев Амир",
				LocalDateTime.now(), "Russia", "Пугачёв", "steamcommunity.com/id/hitry_kazah",
				"Hitry_Kazah", "", "", "ПУПА",
				"Игрок", "disk.yandex.ru/i/7wy1obVsCg4juQ", tournamentHistoryPlayers,
				playerStats);

		playerRepository.save(playerDoc1);
		playerRepository.save(playerDoc2);

		System.out.println("Выводим игрока с именем Актаев Амир");
		playerRepository.findByFname("Актаев Амир");
	}


	private void testTeam() {
		System.out.println("\n-----------Команда-----------");
		teamRepository.deleteAll();

		TeamDoc teamDoc1 = new TeamDoc("ПУПА", "Одна из первых команд города",
				"Россия", "Пугачёв", "disk.yandex.ru/i/ADFb9AuidHo9SQ", 900);

		TeamDoc teamDoc2 = new TeamDoc("DreamTeam", "Вторая из первых команд города",
				"Россия", "Пугачёв", "disk.yandex.ru/i/s8nMFeOec3uklA", 100);

		TeamDoc teamDoc3 = new TeamDoc("G2", "Одна из лучших команд мира",
				"Франция", "Марсель", "", 500);

		teamRepository.save(teamDoc1);
		teamRepository.save(teamDoc2);
		teamRepository.save(teamDoc3);

		System.out.println("Вывод команды с названием ПУПА");
		teamRepository.findByTeamName("ПУПА").forEach(System.out::println);

		System.out.println("\nВывод команды с названием описанием Лучшая из лучших команда");
		teamRepository.findByDescription("Лучшая из лучших команда").forEach(System.out::println);

		System.out.println("\nВывод команды из Марселя");
		teamRepository.findByCity("Марсель").forEach(System.out::println);

		System.out.println("\nВывод команды из России");
		teamRepository.findByCountry("Россия").forEach(System.out::println);

		// удаляем команды из России
		teamRepository.deleteByCountry("Россия");
	}


	private void testTournament(){
		System.out.println("\n-----------Турнир-----------");
		tournamentRepository.deleteAll();

		ArrayList<TournamentHistoryTeams> historyTeams = new ArrayList<TournamentHistoryTeams>();
		historyTeams.add(new TournamentHistoryTeams("ПУПА", "3-4", "1.000 рублей"));
		historyTeams.add(new TournamentHistoryTeams("DreamTeam", "1", "4.000 рублей"));

		ArrayList<Requests> requests = new ArrayList<Requests>();
		requests.add(new Requests("1", "ПУПА", "Одобрено"));
		requests.add(new Requests("2", "DreamTeam", "Одобрено"));
		requests.add(new Requests("3", "zxcCursed", "Отказано"));

		ArrayList<Matches> matches = new ArrayList<Matches>();
		matches.add(new Matches("1", 16, 19, LocalDateTime.now(), "Закончен", "ПУПА", "DreamTeam", "bo3"));

		TournamentDoc tournamentDoc1 = new TournamentDoc("Pugachev Major 2022", LocalDateTime.now(), LocalDateTime.now(),
				"LAN", "Окончен", "Россия", "Пугачёв", "",
				"8.000 рублей", requests, historyTeams, matches);

		TournamentDoc tournamentDoc2 = new TournamentDoc("Zasada Cup", LocalDateTime.now(), LocalDateTime.now(),
				"Online", "Текущий", "Россия", "Вольск", "",
				"200 рублей", requests, historyTeams, matches);

		tournamentRepository.save(tournamentDoc1);
		tournamentRepository.save(tournamentDoc2);

		System.out.println("Вывод турнира с датой старта " + LocalDateTime.now());
		tournamentRepository.findByDateStart(LocalDateTime.now()).forEach(System.out::println);

		System.out.println("\nВывод турнира с датой конца " + LocalDateTime.now());
		tournamentRepository.findByDateEnd(LocalDateTime.now()).forEach(System.out::println);

		System.out.println("\nВывод Онлайн турнира");
		tournamentRepository.findByType("Online").forEach(System.out::println);

		System.out.println("\nВывод текущего турнира");
		tournamentRepository.findByStatus("Текущий").forEach(System.out::println);

		System.out.println("\nВывод турнира из России");
		tournamentRepository.findByCountry("Россия").forEach(System.out::println);

		System.out.println("\nВывод турнира из Пугачёва");
		tournamentRepository.findByCity("Пугачёв").forEach(System.out::println);

		System.out.println("\nВывод турнира с призовым 8.000 рублей");
		tournamentRepository.findByPrize("8.000 рублей").forEach(System.out::println);

		System.out.println("\nВывод турнира с названием: Pugachev Major 2022");
		tournamentRepository.findByName("Pugachev Major 2022").forEach(System.out::println);

		// удаляем по названию
		tournamentRepository.deleteByName("Pugachev Major 2022");
	}


	private void testAdmin(){
		System.out.println("\n------------Админ------------");
		adminRepository.deleteAll();

		adminRepository.save(new AdminDoc("Tamada"));
		adminRepository.save(new AdminDoc("da4aTama"));
		adminRepository.save(new AdminDoc("ugly4"));

		// удаляем по id
		adminRepository.deleteByAdminId("Tamada");

		System.out.println("Вывод админа с id ugly4");
		adminRepository.findByAdminId("ugly4").forEach(System.out::println);

		System.out.println("\nВывод всех админов");
		adminRepository.findAll().forEach(System.out::println);
	}
}
